bench-results/fan-3host-20260601T011018Z/oldA/direct-run/fio-randwrite-32lane.txt
direct32-randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=64
...
fio-3.36
Starting 64 processes

direct32-randwrite: (groupid=0, jobs=64): err= 0: pid=193984: Mon Jun  1 01:13:02 2026
  write: IOPS=4919k, BW=18.8GiB/s (20.1GB/s)(93.9GiB/5002msec); 0 zone resets
    slat (nsec): min=917, max=173313, avg=3630.80, stdev=1189.17
    clat (usec): min=162, max=5580, avg=828.52, stdev=324.57
     lat (usec): min=168, max=5584, avg=832.15, stdev=324.53
    clat percentiles (usec):
     |  1.00th=[  306],  5.00th=[  347], 10.00th=[  453], 20.00th=[  717],
     | 30.00th=[  742], 40.00th=[  758], 50.00th=[  775], 60.00th=[  791],
     | 70.00th=[  857], 80.00th=[  947], 90.00th=[ 1139], 95.00th=[ 1319],
     | 99.00th=[ 2147], 99.50th=[ 2573], 99.90th=[ 3752], 99.95th=[ 3884],
     | 99.99th=[ 4080]
   bw (  MiB/s): min=14013, max=26355, per=99.91%, avg=19200.04, stdev=79.69, samples=580
   iops        : min=3587479, max=6746899, avg=4915208.62, stdev=20401.15, samples=580
  lat (usec)   : 250=0.01%, 500=11.13%, 750=24.23%, 1000=48.26%
  lat (msec)   : 2=15.28%, 4=1.08%, 10=0.02%
  cpu          : usr=4.95%, sys=38.75%, ctx=12903884, majf=0, minf=401
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,24607001,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=18.8GiB/s (20.1GB/s), 18.8GiB/s-18.8GiB/s (20.1GB/s-20.1GB/s), io=93.9GiB (101GB), run=5002-5002msec

Disk stats (read/write):
  zcnblk0: ios=0/23913464, sectors=0/191307824, merge=0/0, ticks=0/19745105, in_queue=19745106, util=97.40%